import React, { Component } from 'react';
import { StyleSheet, Text, View, SafeAreaView, TextInput, TouchableOpacity, ScrollView } from 'react-native';

class privacypolicy extends Component {
    render() {
        return (
            <ScrollView>
                <Text style={styles.text}>privacypolicy</Text>
                <Text style={styles.text2}>techician online ได้ตระหนักถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคล
                    และมีความยินดีเป็นอย่างยิ่งที่ท่านให้ความสนใจในการใช้บริการของเรา techician onlineจึง
                    ได้จัดทำนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ขึ้นเพื่อใช้บังคับกับเจ้าของข้อมูลส่วนบุคคลซึ่งใช้บริการ
                    ทำธุรกรรม หรือร่วมกิจกรรมใดๆ ในอนาคต โดยมีหลักเกณฑ์ กลไก มาตรการกำกับดูแล
                    และการบริหารจัดการข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562 เราอาจแก้ไขเปลี่ยนแปลงนโยบายนี้เป็นครั้งคราว
                    โดยท่านสามารถทราบข้อกำหนดและเงื่อนไขนโยบายที่มีการแก้ไขเปลี่ยนแปลงนี้ได้ผ่านทางเว็บไซต์ของเรา น
                    โยบายนี้แก้ไขล่าสุดและมีผลใช้บังคับตั้งแต่วันที่ 1 มกราคม 2565
                </Text>
                <Text style={styles.text2}>1. ข้อมูลส่วนบุคคลที่เราเก็บ
                    บริษัทจะเก็บรวบรวมข้อมูลส่วนบุคคลที่ท่านได้กรอกเข้ามา โดยมีวัตถุประสงค์ ขอบเขตและใช้วิธีการที่ชอบด้วยกฎหมาย ข้อมูลส่วนบุคคลทั้งหมดต้องถูกให้ความยินยอมจากเจ้าของข้อมูลส่วนบุคคลนั้นแล้ว โดยในการเก็บนั้นจะทำเพียงเท่าที่จำเป็นแก่การดำเนินงานภายใต้วัตถุประสงค์ของบริษัท ทั้งนี้บริษัทจะดำเนินการให้เจ้าของข้อมูลรับรู้ให้ความยินยอมทางอิเล็กทรอนิกส์ หรือตามแบบวิธีการของบริษัท
                    บริษัทอาจมีการเก็บข้อมูลเพิ่มหลังจากที่ท่านได้มีการทำธุรกรรม ทั้งในรูปแบบบุคคลและนิติบุคคลเพื่อสนันสนุนการใช้งานและประสบการณ์ของท่านให้ดีที่สุด
                </Text>
                <Text style={styles.text2}>2. การประมวลผลข้อมูลส่วนบุคคล
                    เราจะประมวลผลข้อมูลส่วนบุคคลของคุณเพื่อให้บริการตามที่ท่านสมัคร ร้องขอ และ เพื่อการให้บริการที่มีประสิทธิภาพสูงสุด โดยข้อมูลของท่านเราจะนำไปใช้เพื่อวัตถุประสงค์ดังต่อไปนี้
                    ก. เพื่อสร้างและจัดการบัญชีผู้ใช้งาน
                    ข. เพื่อจัดส่งสินค้าหรือบริการ
                    ค. เพื่อปรับปรุงสินค้า บริการ หรือประสบการณ์การใช้งาน
                </Text>
                <Text style={styles.text2}>3. วิธีการเก็บรักษาข้อมูลส่วนบุคคลและความปลอดภัย
                    เราจะรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลของท่านไว้ตามหลักการการรักษาความลับ ความถูกต้องครบถ้วน และสภาพพร้อมใช้งาน เพื่อป้องกันการสูญหาย เข้าถึง ใช้ เปลี่ยนแปลง แก้ไข หรือเปิดเผย นอกจากนี้เราจะจัดให้มีมาตรการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคล ซึ่งครอบคลุมถึงมาตรการป้องกันด้านการบริหารจัดการ มาตรการป้องกันด้านเทคนิค และมาตรการป้องกันทางกายภาพ ในเรื่องการเข้าถึงหรือควบคุมการใช้งานข้อมูลส่วนบุคคล
                </Text>
                <Text style={styles.text2}>4. การเปิดเผยข้อมูลส่วนบุคคล
                    เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณให้แก่ผู้อื่นภายใต้ความยินยอมของท่านหรือที่กฎหมายอนุญาตให้เปิดเผยได้และอาจเปิดเผยข้อมูลส่วนบุคคลของคุณภายในบริษัทเท่าที่จำเป็นเพื่อปรับปรุงและพัฒนาสินค้าหรือบริการของเรา เราอาจรวบรวมข้อมูลภายในสำหรับสินค้าหรือบริการต่าง ๆ ภายใต้นโยบายนี้เพื่อประโยชน์ของคุณและผู้อื่นมากขึ้น
                </Text>
                <Text style={styles.text2}>5. สิทธิของเจ้าของข้อมูลส่วนบุคคล
                    ก. การเพิกถอนความยินยอม : ท่านมีสิทธิที่จะเพิกถอนความยินยอมของท่านในการจัดเก็บ ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
                    ข. การขอเข้าถึงข้อมูลส่วนบุคคล : ท่านสามารถขอเข้าถึง ขอรับสำเนาข้อมูลส่วนบุคคลของท่าน หรือขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคล
                    ค. การได้รับข้อมูลอิเล็กทรอนิกส์และถ่ายโอนข้อมูล : ท่านมีสิทธิที่จะได้รับข้อมูลที่ได้ให้ไว้กับบริษัทในรูปแบบอิเล็กทรอนิกส์ และมีสิทธิในการถ่ายโอนข้อมูลของท่านสำหรับการใช้งานในบริการของบุคคลอื่น
                    ง. การคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล : ท่านมีสิทธิคัดค้านการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลเกี่ยวกับท่าน
                    จ. การขอลบ หรือเปลี่ยนแปลงสถานะข้อมูลส่วนบุคคล : ท่านสามารถขอให้ลบหรือทำลาย หรือทำให้ข้อมูลส่วนบุคคลของท่านกลายเป็นข้อมูลที่ไม่ระบุตัวบุคคล
                    ฉ. การขอให้ระงับการประมวลผลข้อมูลส่วนบุคคล : ท่านสามารถขอให้บริษัทระงับการประมวลผลข้อมูลส่วนบุคคลของท่านทั้งหมด หรือบางส่วน เป็นการชั่วคราวหรือถาวร
                    ช. การแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง : ท่านสามารถขอแก้ไข หรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของท่าน ในกรณีที่ข้อมูลส่วนบุคคลของท่านไม่ถูกต้องตามความเป็นจริง และทำให้ข้อมูลของท่านเป็นปัจจุบัน
                    ซ. การร้องเรียน : ท่านมีสิทธิร้องเรียนต่อหน่วยงานของรัฐที่เกี่ยวข้อง ในกรณีที่ท่านเชื่อว่าการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลของบริษัทนั้นฝ่าฝืนหรือไม่ปฏิบัติตามพ.ร.บ.คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                </Text>
            </ScrollView>

        )
    }
}


const styles = StyleSheet.create({

    text: {
        marginLeft: "auto",
        marginRight: "auto",
        fontWeight: "bold",
        fontSize: 22,
        paddingTop: 15,
    },
    text2: {
        textAlign: "left",
        fontSize: 16,
        padding: 20,
        paddingTop: 15,
    },

});
export default privacypolicy;